[
    {
        "id": 1,
        "name": "Vikas Khanna",
        "recipes": [
            {
                "id": "Vikas_Khanna_recipe-1",
                "name": "Masala Honey Cornish Hens",
                "ingredients": [
                    "One-pound Cornish hens rinsed well and patted dry- 4",
                    "Salt- 1/2 tablespoon",
                    "Lavender powder ground- 1/4 cup",
                    "Garam masala- 1/4 cup",
                    "Soy sauce- 2 tablespoons",
                    "Juice of 2 lemons",
                    "Olive oil- 1/4 cup",
                    "Sprigs for garnish"
                ],
                "cooking_method": "Preheat oven to 400 degrees Fahrenheit. Season the hens with salt and set aside for ten minutes.ake a bowl and add lemon juice, honey, lavender flowers, soy sauce, and garam masala. Mix well. Marinade the hens. Heat oil and sear the hens. oast the hens in the oven. Insert the thermometer in the thigh of hens and wait till it reads 165 degrees F. Garnish with lavender sprigs.",
                "ratings": 4.8
            },
            {
                "id": "Vikas_Khanna_recipe-2",
                "name": "Le Cordon Bleu Fresh Vegetables",
                "ingredients": [
                    "Asparagus, peeled, trimmed- 1 bunch",
                    "Baby carrots, peeled- 4",
                    "Ripe cherry tomatoes-10 to 12",
                    "Snow peas- 10",
                    "Extra virgin olive oil- 3 tablespoons",
                    "Sprigs of Dill",
                    "Red radish- 5",
                    "Salt to taste",
                    "Juice of 1 lemon",
                    "Cayenne pepper- 1 teaspoon"
                ],
                "cooking_method": "Fill a large pot with salted water and add carrots and asparagus. Boil over medium heat, Cook for about six minutes. Remove the vegetables. Add snow peas to the same water and cook for two minutes. Heat oil in a pan and add all the vegetables. Stir fry for two minutes. Add lemon juice, cayenne pepper, and dill and mix well.",
                "ratings": 4.5
            },
            {
                "id": "Vikas_Khanna_recipe-3",
                "name": "Ginger and Sesame Seeds-Coated Wild Salmon",
                "ingredients": [
                    "Salmon fillets (6-ounce), about 1-inch thick- 4",
                    "Salmon fillets (6-ounce), about 1-inch thick- 4",
                    "Dark sesame oil- 1 teaspoon",
                    "Cooking spray",
                    "Lemons cut into very thin slices- 2",
                    "Mixed sesame seeds- 1/4 cup",
                    "Finely minced fresh ginger- 2 tablespoon",
                    "Salt to taste"                   
                ],
                "cooking_method": "Drizzle oil over the fish and rest for ten minutes. Add sesame seeds, cilantro, ginger, and salt in a bowl. Marinate the fillets with this mixture. Place the fillets on an aluminium foil with lemon slices. Fold the edges tightly. Bake in a pre-heated oven at 425° F for 12 to 15 minutes.",
                "ratings": 4.8
            }
        ]
    },
    {
        "id": 2,
        "name": "Sanjeev Kapoor",
        "recipes": [
            {
                "id": "Sanjeev_Kapoor_recipe_1",
                "name": "Masala Pav",
                "ingredients": [
                    "Pavs 8",
                    "Potatoes 2 large",
                    "Onions chopped 2 large",
                    "Capsicum chopped 1 small",
                    "Tomato chopped 1 large",
                    "Salt to taste",
                    "Pav bhaji masala 2 teaspoons",
                    "Oil 1 teaspoon",
                    "Fresh coriander leaves chopped 2 tablespoons",
                    "Lettuce few leaves"
                ],
                "cooking_method": "Slit the pavs into two halves. Heat the oil in a non stick pan. Add onions and sauté for two minutes. Add green capsicum and sauté. Meanwhile keep the slit pavs on a heated grill, close the lid and cook. Add tomatoes to the pan and continue to sauté. Add salt and quarter cup water and mix. Add pav bhaji masala and mix. Add the boiled potatoes and another quarter cup of water and cook till all the ingredients blend well and the mixture is quite dry. Add coriander leaves and mix. Place lettuce leaves over the bread halves. Spread the cooked filling over them, fold each half and serve immediately.",
                "ratings": 4.5
            },
            {
                "id": "Sanjeev_Kapoor_recipe_2",
                "name": "Pizza Roll Ups",
                "ingredients": [
                    "Fresh yeast 20 grams",
                    "Sugar 1 teaspoon",
                    "Salt 2 teaspoons",
                    "Refined flour (maida) 1 1/2 cups for dusting",
                    "Olive oil 1 tbsp + for greasing",
                    "Pizza sauce 1/4 cup",
                    "Mozzarella cheese grated 1/2 cup",
                    "Sweetcorn kernels , boiled 1/4 cup",
                    "Button mushrooms , chopped 4-5",
                    "Mixed capsicums , finely chopped 1/4 cup",
                    "Pickled jalapeno , chopped 1",
                    "Dried oregano to sprinkle",
                    "Red chilli flakes to sprinkle"
                ],
                "cooking_method": " Place yeast in a big bowl, add sugar, 1 tsp salt and 2-3 tbsps of warm water and set aside for 10-15 minutes. Add flour, olive oil and remaining salt to the activated yeast and mix well. Add sufficient water and knead into soft dough. Cover with a wet muslin cloth and set aside for 15-20 minutes in a warm place. Preheat the oven to 200°C. Grease a baking tray with oil. Dust some flour on the work table, place the dough over it and roll it into a thin rectangular sheet. Apply pizza sauce and sprinkle mozzarella cheese. Top with corn, mushrooms, mixed capsicums and jalapeno. Sprinkle dried oregano and chilli flakes. Roll tightly and cut into thick slices. Place the slices on a baking tray keeping some distance between each and bake for 10-15 minutes. Remove the tray from the oven and let them cool. Wrap in Freshwrapp and pack them in the tiffin box.",
                "ratings": 4.5
            },
            {
                "id": "Sanjeev_Kapoor_recipe_3",
                "name": "Aam Papad Challi",
                "ingredients": [
                    "Regular aam papad a few pieces",
                    "Kala aam papad a few pieces",
                    "Corn on the cob 1",
                    "Oil for drizzling",
                    "Butter for brushi",
                    "Red chilli powder 1 teaspoon",
                    "Black salt to taste",
                    "Chaat masala 1 tsp + to sprinkle",
                    "Lemon juice 2 teaspoons"
                    
                ],
                "cooking_method": "Peel corn on cob and roast directly on high flame. Heat a non-stick grill pan. Cut roasted corn on cob into 3 portions, halve and place on the hot pan. Drizzle some oil and toss well. Brush the corn pieces with some butter, add red chilli powder, black salt, chaat masala and lemon juice. Top with regular and kala aam papad pieces and cook till soft. Transfer into a serving bowl, sprinkle chaat masala and serve immediately.",
                "ratings": 4.6
            }
        ]
    },
    {
        "id": 3,
        "name": "Kunal Kapur",
        "recipes": [
            {
                "id": "Kunal_Kapur_recipe_1",
                "name": "Boneless Tandoori Chicken Tikka",
                "ingredients": [
                   "Chicken leg boneless — 500 gm",
                   "Salt to taste",
                   "1 nos Lemon",
                   "½ tbsp Ginger paste",
                   "½ tbsp Garlic paste",
                   "5 tsp Mustard Oil",
                   "1½ tbsp Kashmiri chilli powder",
                   "1 cup Curd",
                   "to taste Salt",
                   "1½ nos Lemon",
                   "½ tbsp Ginger paste",
                   "1½ tbsp Lemon juice",
                   "a pinch Chaat masala",
                   "½ tsp Kasoori methi powder"

                ],
                "cooking_method": "Pat dry the chicken and it with sprinkle salt, lemon juice, ginger and garlic paste. Mix and keepaside for at least half hour.Meanwhile pour mustard oil in a fresh bowl and add kashmiri chilli powder to it. Stir and add thickcurd, lemon juice, salt, ginger paste, garlic paste and methi leaves powder. Mix it and keep aside. Now squeeze between your palm the chicken to remove any excess moisture. Place the chicken inthe second marinade mix to coat the chicken evenly.Heat a grill pan to high. Lightly oil it and place the chicken pieces on high heat on the pan. Within2-3 mins turn over to get grill marks on the other side as well. Now lower the heat and cook thechicken on both sides till it is cooked. This may take 15-20 mins. Alternatively you can cook thechicken in an over preheated to 220c for 20 mins. Remove and serve hot with a lemon wedge and sprinkle some chaat masala.",
                "ratings": 4.7
            },
            {
                "id": "Kunal_Kapur_recipe_2",
                "name": "Thandai Milkshake",
                "ingredients": [
                    "Milk (full fat) – 1 lt",
                    "Cashew nuts (soaked) – ¼ cup",
                    "Almonds (soaked) – ¼ cup",
                    "Pista (soaked) – ¼ cup",
                    "Cardamom (soaked) – 10nos",
                    "Peppercorns (soaked) – 10nos",
                    "Poppy Seeds (soaked) – 2 tbsp",
                    "Fennel Seeds (soaked) – 1½ tbsp",
                    "Watermelon seeds (soaked) – 2tbsp",
                    "Cucumber seeds (soaked) – 1 tbsp",
                    "Rose water – 1tbsp",
                    "Cinnamon Powder – ½ tsp",
                    "Nutmeg Powder – ½ tsp",
                    "Saffron (soaked)", 
                    "Water-a dash ",
                    "Sugar to taste",
                    "Ice cubes – few"
                ],
                "cooking_method": "To prepare thandai we have to make sure that all the ingredients that require soaking are soaked at least for 30mins in water. You can soak saffron in water or milk. Pour milk in a pan and bring it to a boil and let it simmer. Add cashew nuts, almonds, pista, cardamom, peppercorns, poppy seeds, fennel seeds, watermelon seeds, cucumber seeds, rose water, cinnamon powder, nutmeg powder, saffron and a dash of water in a blender and blend it till it is a fine puree. If required add more water. Add sugar to taste to the milk and then mix in this puree making sure to whisk the milk while adding it. Bring to a boil again and simmer for another 5mins. Remove and cool it completely. In a glass add ice cubes and pour the thandai drink over it and serve chilled.",
                "ratings": 4.5
            },
            {
                "id": "Kunal_Kapur_recipe_3",
                "name": "Carrot Spread",
                "ingredients": [
                    "250 gms/2 cups Carrots (Sliced)",
                    "250ml/1 cup Orange Juice",
                    "2 tsp Ginger chopped",
                    "½ tsp Black salt",
                    "to taste Salt",
                    "¾ tsp Chilli powder",
                    "2 tbsp Butter",
                    "1 tsp Roasted Cumin Powder"
                ],
                "cooking_method": "For carrot spread, cut red carrots thinly, and add to a pan. Strain the orange juice and add to the pan. Turn on the heat. Add ginger, black salt, salt, and chilli powder then boil it. Now cook it for 15 to 20 mins. Now add butter and roasted cumin powder. And then puree the carrots without adding water. Tasty and healthy carrot spread is ready to be served.",
                "ratings": 4.2
            }
        ]
    },
    {
        "id": 4,
        "name": "Ranveer Brar",
        "recipes": [
            {
                "id": "Ranveer_Brar_recipe_1",
                "name": "Orange & Rosemary Mocktail",
                "ingredients": [
                    "2 Sprigs Fresh Rosemary",
                    "2 Slices Lemon",
                    "½ Malta Orange, sliced",
                    "1 tsp Castor Sugar",
                    "2 Cups Orange Juice, chilled",
                    "2 Cups Club Soda, chilled",
                    "For Garnish",
                    "2 Sprigs Fresh Rosemary",
                    "½ Malta Orange, sliced"
            ],
                "cooking_method": "In a jug, combine rosemary, lemon, orange slice, castor sugar and muddle with a muddler. Pour in the orange juice and mix well. Let it sit for 2mins. Strain the juice and pour in the soda. Portion out in glasses and garnish with rosemary spring and orange slice.",
                "ratings": 4.4
            },
            {
                "id": "Ranveer_Brar_recipe_2",
                "name": "Khatti Meethi Kiwi Chuski",
                "ingredients": [
                    "8-10 Golden Kiwi",
                    "1 cup powdered sugar",
                    "¼ cup water",
                    "2 tbsps Kiwi squash",
                    "Few ice cream sticks to prick"
                ],
                "cooking_method": "Place sugar & water in a saucepan & stir over low heat until the sugar dissolves fully. Remove from heat & cool. Peel and make puree of Golden Kiwis in blender. Rub the puree through sieve to get fine pulp juice. Now combine all the ingredients and place into ice tray. Prick 1 stick into each cube. Freeze until ready to use. when ready pick each cube",
                "ratings": 4.8
            },
            {
                "id": "Ranveer_Brar_recipe_3",
                "name": "Spicy Orange Salad",
                "ingredients": [
                    "1 tbsp White Wine Vinegar/ Vinegar",
                    "2 tbsp Olive Oil",
                    "Salt, to taste",
                    "1 tsp Siracha Sauce/ Hot Sauce",
                    "2 Malta Orange, Peeled/ Orange Segments, Peeled",
                    "1 Medium Onion, peeled",
                    "6-8 Black Olives, sliced",
                    "1 Small Fennel Bulb, cut into strips",
                    "2 Small Red Radish, sliced/ White Radish",
                    "Few Mint Leaves",
                    "¼ tsp Paprika Powder/ Chili Powder"
                ],
                "cooking_method": "For dressing, in a bowl take white wine vinegar. Now in a stream add olive oil while whisking. Now add salt and siracha sauce, mix well. Keep aside. Peel the oranges and cut them in roundels. Cut the onion and slice thinly. Sperate the segments. Now on a plate, arrange orange roundels. Now place onion, olives, fennel, radish on top of orange. Lastly top it off with mint leaves and sprinkle paprika powder. When serving drizzle some dressing and serve immediately. ",
                "ratings": 4.9
            }
        ]
    },
    {
        "id": 5,
        "name": "Pankaj Bhadouria",
        "recipes": [
            {
                "id": "Pankaj_Bhadouria_recipe_1",
                "name": "Watermelon Jello",
                "ingredients": [
                    "10g Agar Agar (China Grass)",
                    "750ml Watermelon juice (pulpy)",
                    "3tbsp Sugar"
                    
                ],
                "cooking_method": "Soak the agar agar in 1 cup water for 20 minutes. Cut the top of 1 medium sized Watermelon and scoop out the pulp. Blend the pulp in a blender to get a thick mushy pulp. Remove the soaked agar agar from water and place in a pan over medium heat. Cook, stirring constantly, till the agar agar has melted. Add in the fruit pulp and the sugar and bring the mixture to a boil. Simmer for 2 minutes, remove from heat and pass through a strainer. Pout the strained liquid in the empty watermelon and cover. Place in the refrigerator to chill for at least 3 hours. Once set and chilled, remove the watermelon from the refrigerator and cut into slices. You can serve the sliced jello or also cut it into cubes and serve!                ",
                "ratings": 4.6
            },
            {
                "id": "Pankaj_Bhadouria_recipe_2",
                "name": "Garlic Pickle",
                "ingredients": [
                    "½ cup Mustard oil",
                    "1 cup Garlic cloves",
                    "2 tbsp Kashmiri Red Chilli powder",
                    "1 tsp Turmeric",
                    "¼ tsp Asafoetida",
                    "2 tsp Mustard Seeds",
                    "½ tsp Fenugreek Seeds",
                    "1 tsp Fennel Seeds",
                    "3 tsp Salt",
                    "4 tbsp White Vinegar"
                ],
                "cooking_method": "Grind together the mustard seeds, fenugreek seeds, fennel seeds to a fine powder. Heat the oil to smoke point and cool to medium hot. Add in the garlic cloves and saute for a minute. Remove from flame and cool. Add the powdered spices, red chili powder, salt, turmeric, vinegar and mix well. Fill in clean sterilised glass bottle and close lid. Set aside for 3-4 days, shaking every day to mix well. Ready to eat in 3 days.",
                "ratings": 4.9
            },
            {
                "id": "Pankaj_Bhadouria_recipe_3",
                "name": "Caffe Choco Cardamom Bombs",
                "ingredients": [
                    "Double cream 600ml",
                    "Cardamom pods 30, split and seeds lightly crushed",
                    "Extra- strong coffee 100ml",
                    "Egg yolks 8",
                    "Golden caster sugar 150g",
                    "70% dark chocolate 200g"
                ],
                "cooking_method": "Heat the cream with the cardamom seeds and coffee over a very gentle heat for about 10 minutes. Allow to cool. Put the egg yolks and sugar in a bowl. Whish until the mixture is a pale in colour. Reheat the flavoured cream and pour through a sieve into a jug, discarding the cardamom. Pour the sieved milk over the yolk mixture, while stirring constantly. Reheat in a pan over a gentle heat, until the custard thickens and coats the back of a wooden spoon. Do not over-heat as the mixture will curdle. Pour into an ice-cream machine and churn. Freeze overnight. If you do not have an ice-cream machine, freeze the mixture over night, remove and run in a mixture and refreeze . remove and repeat twice for a smooth ice-cream. Scoop into balls and line up on a greaseproof-lined, pre-frozen baking sheet and heat proof bowl set over simmering water. Once the chocolate has cooled, yet still liquid, spoon over the ice cream balls until coated. Refreeze until needed.",
                "ratings": 4.8
            }
        ]
    },
    {
        "id": 6,
        "name": "Shipra Khanna",
        "recipes": [
            {
                "id": "Shipra_Khanna_recipes_1",
                "name": "Chocnut Torte",
                "ingredients": [
                    "Eggs 2",
                    "Refined flour 1 cup",
                    "Baking powder 1 tsp",
                    "Milk 1 cup",
                    "Castor sugar 2 tbsps",
                    "Butter as required",
                    "Kissan mixed fruit jam as required"
                ],
                "cooking_method": "Break eggs into a bowl, add flour, baking powder, milk and sugar and whisk till you get a smooth and thick batter adding water if required.Heat some butter in a non-stick pan, pour a ladle full of batter and spread it evenly. Cook till the underside is golden, then flip and cook till the other side is equally done. Use up all the batter similarly.Transfer the pancakes into serving plates and serve them hot with jam.",
                "ratings": 4.5
            },
            {
                "id": "Shipra_Khanna_recipes_2",
                "name": "Strawberry Shortcake",
                "ingredients": [
                    "Purple yam, peeled, cut into chunks and boiled 250 gms",
                    "Double cream 200 gms",
                    "Sugar 1 cup",
                    "Fennel seeds (saunf) 1 tsp",
                    "Hazelnuts 1 cup",
                    "Vermicelli sticks to garnish"
                ],
                "cooking_method": "Put yam chunks in a blender jar, add 1 cup water and grind to a paste.Heat cream in a non-stick pan, add yam paste and mix well. Add fennel seeds and mix well.Add ½ cup sugar, mix well and let the mixture come to a boil. Take the pan off heat and set aside to cool down to room temperature.Heat remaining sugar in another non-stick pan and let it caramelize. Add hazelnuts and mix well.Transfer into a plate and let it cool slightly.Dip the rims of serving glasses in the caramelized mixture.Transfer the mousse into these glasses. Put some caramelized hazelnuts on top of the mousse in each glass.Decorate with vermicelli sticks. Keep the glasses in the refrigerator to chill before serving.",
                "ratings": 4.6
            },
            {
                "id": "Shipra_Khanna_recipes_3",
                "name": "Tomatokeftedes ",
                "ingredients": [
                    "Medium tomato, finely chopped 1",
                    "Fresh parsley or fresh coriander leaves, chopped ½ cup",
                    "Fresh mint leaves ½ cup",
                    "Salt to taste",
                    "Spring onions (hare pyaz), finely chopped 1 cup",
                    "Refined flour (maida) 1 cup",
                    "Baking powder 1 tsp",
                    "Oil to deep fry"
                ],
                "cooking_method": "Take tomato, parsley/coriander leaves, mint leaves, salt and spring onions in a bowl and mix well.Take refined flour and baking powder in another bowl and mix well. Add this to the tomato mixture. Add ½ cup water, little at a time, and mix so that the batter is smooth and thick.Heat sufficient oil in a wok. To test if the oil is hot enough, put a small blob of batter in it. If the batter surfaces up as a lump, it means the oil is hot enough for frying.Put spoonsful of batter into the hot oil, in batches, and deep fry for 4-5 minutes, on high heat, till golden brown. Drain on absorbent paper to soak excess oil.Serve hot.",
                "ratings": 4.3
            }
        ]
    }
]